
#include <stdio.h>	 //підключення стандартних бібліотек stdio - standard input-output
#include <windows.h> //підключаємо бібліотеку windows.h для встановлення української локалізації

int main()
{
	SetConsoleCP(1251);														 // встановлюємо кодування символів 1251 для введенн  зконсолі
	SetConsoleOutputCP(1251);											 // встановлюємо кодування символів 1251 для виведення у консоль
	printf("Hello, world!");											 // виводимо повідомлення
	printf("We are happy to see this program!\n"); // виводимо повідомлення але з       переходом на новий рядок
	printf("Привіт світ!\n");											 // моя улюблена фраз
	printf("**************\n");										 // верхня частина таблиці з переходом на новий рядок
	printf("*Привіт світ!*\n");										 // середина таблця з переходом на новий рядок
	printf("**************");											 // нижня частина таблиці з переходом на новий рядок
	return 0;
}
