#include <stdio.h>
#include <math.h>		 // Для використання функції M_PI (значення числа π)
#include <windows.h> // Для встановлення української локалізації

Int main()
{
	// Встановлення кодування для введення і виведення в консолі Windows
	SetConsoleCP(65001);			 // Кодування для введення
	SetConsoleOutputCP(65001); // Кодування для виведення

	double R;													 // Радіус кулі
	double V_sphere, V_cube, V_figure; // Об'єми кулі, куба та фігури

	// Введення радіуса
	printf("Введіть радіус R (позитивне число): ");
	// якщо true віконується виведення помилки и функція main() закіняує роботу
	if (scanf("%lf", &R) != 1 || R <= 0)
	{
		printf("Помилка: введіть позитивне правильне число для радіусу.\n");
		return 1;
	}

	// Обчислення об'єму кулі
	V_sphere = (4.0 / 3.0) * M_PI * pow(R, 3);

	// Обчислення об'єму куба
	V_cube = pow(2 * R, 3);

	// Обчислення об'єму фігури
	V_figure = V_cube - V_sphere;
	// виводимо повідомлення про автора і що виконує програма
	printf("Програму виконав студент гр. АІ-243 Гаврилов О.В.\n");
	// Виведення результату
	printf("Об'єм фігури після віднімання об'єму кулі з об'єму куба: %.2lf\n", V_figure);

	return 0;
}
